# Pandas

# PART 1

In [124]:
import pandas as pd
import seaborn as sns
import numpy as np

In [98]:
pd.__version__

'2.2.1'

In [99]:
list1 = [1,-3,3.4,"prajwal"]
list1

[1, -3, 3.4, 'prajwal']

In [100]:
pd.Series(list1)
# series = 1d array

0          1
1         -3
2        3.4
3    prajwal
dtype: object

In [101]:
pd.Series([22,33,44,55])

0    22
1    33
2    44
3    55
dtype: int64

In [102]:
pd.Series([22,33,44,55],index = ['a','b','c','d'],dtype=float,name = "Marks") # name = title name

a    22.0
b    33.0
c    44.0
d    55.0
Name: Marks, dtype: float64

In [103]:
pd.Series(3,index = ['a','b','c','d'])

a    3
b    3
c    3
d    3
dtype: int64

In [104]:
pd.Series({"a":1,"b":2})

a    1
b    2
dtype: int64

In [105]:
par = pd.Series([22,33,44,55,66,77])

In [106]:
par[par > 2]

0    22
1    33
2    44
3    55
4    66
5    77
dtype: int64

# PART 2

## DataFrame

In [107]:
list1 = [1,2,3,4]
df = pd.DataFrame(list1)
df

   0
0  1
1  2
2  3
3  4

In [108]:
df = pd.read_csv(r"C:\Users\Prajwal\seoulcleandata.csv",nrows=5)
df

,Rented Bike Count,Hour,Temperature(°C),Humidity(%),Wind speed (m/s),Visibility (10m),Solar Radiation (MJ/m2),Rainfall(mm),Snowfall (cm),Holiday,...,Year,Spring,Summer,Winter,Monday,Saturday,Sunday,Thursday,Tuesday,Wednesday
0,254,0,-5.2,37,2.2,2000,0.0,0.0,0.0,0,...,2017,0,0,1,0,0,0,1,0,0
1,204,1,-5.5,38,0.8,2000,0.0,0.0,0.0,0,...,2017,0,0,1,0,0,0,1,0,0
2,173,2,-6.0,39,1.0,2000,0.0,0.0,0.0,0,...,2017,0,0,1,0,0,0,1,0,0
3,107,3,-6.2,40,0.9,2000,0.0,0.0,0.0,0,...,2017,0,0,1,0,0,0,1,0,0
4,78,4,-6.0,36,2.3,2000,0.0,0.0,0.0,0,...,2017,0,0,1,0,0,0,1,0,0

In [109]:
# nrows = it gives number of rows 
# usecols = it gives we can choose how many columns we want
df = pd.read_csv(r"C:\Users\Prajwal\seoulcleandata.csv",nrows=5,usecols=[0,2,4])
df

   Rented Bike Count  Temperature(°C)  Wind speed (m/s)
0                254             -5.2               2.2
1                204             -5.5               0.8
2                173             -6.0               1.0
3                107             -6.2               0.9
4                 78             -6.0               2.3

In [110]:
# remove any rows 
df = pd.read_csv(r"C:\Users\Prajwal\seoulcleandata.csv",skiprows=[1,2,4])
df.head(2)

,Rented Bike Count,Hour,Temperature(°C),Humidity(%),Wind speed (m/s),Visibility (10m),Solar Radiation (MJ/m2),Rainfall(mm),Snowfall (cm),Holiday,...,Year,Spring,Summer,Winter,Monday,Saturday,Sunday,Thursday,Tuesday,Wednesday
0,173,2,-6.0,39,1.0,2000,0.0,0.0,0.0,0,...,2017,0,0,1,0,0,0,1,0,0
1,78,4,-6.0,36,2.3,2000,0.0,0.0,0.0,0,...,2017,0,0,1,0,0,0,1,0,0

In [111]:
# default index is 0,1,2,3,
# but i want rented bike count as a index
df = pd.read_csv(r"C:\Users\Prajwal\seoulcleandata.csv",index_col="Rented Bike Count")
df.head(2)

,Hour,Temperature(°C),Humidity(%),Wind speed (m/s),Visibility (10m),Solar Radiation (MJ/m2),Rainfall(mm),Snowfall (cm),Holiday,Functioning Day,...,Year,Spring,Summer,Winter,Monday,Saturday,Sunday,Thursday,Tuesday,Wednesday
Rented Bike Count,,,,,,,,,,,,,,,,,,,,,
254,0,-5.2,37,2.2,2000,0.0,0.0,0.0,0,1,...,2017,0,0,1,0,0,0,1,0,0
204,1,-5.5,38,0.8,2000,0.0,0.0,0.0,0,1,...,2017,0,0,1,0,0,0,1,0,0

# PART 3

## How to write csv file #2 in Pandas

In [112]:
df = pd.read_csv(r"C:\Users\Prajwal\seoulcleandata.csv")
df.head(2)

,Rented Bike Count,Hour,Temperature(°C),Humidity(%),Wind speed (m/s),Visibility (10m),Solar Radiation (MJ/m2),Rainfall(mm),Snowfall (cm),Holiday,...,Year,Spring,Summer,Winter,Monday,Saturday,Sunday,Thursday,Tuesday,Wednesday
0,254,0,-5.2,37,2.2,2000,0.0,0.0,0.0,0,...,2017,0,0,1,0,0,0,1,0,0
1,204,1,-5.5,38,0.8,2000,0.0,0.0,0.0,0,...,2017,0,0,1,0,0,0,1,0,0

In [113]:
df1 = pd.read_csv(r"C:\Users\Prajwal\seoulcleandata.csv",header=2)
df1.head(2)
# if we dont want header in numbers then (header=None)

,204,1,-5.5,38,0.8,2000,0.0,0.0.1,0.0.2,0,...,2017,0.1,0.2,1.3,0.3,0.4,0.5,1.4,0.6,0.7
0,173,2,-6.0,39,1.0,2000,0.0,0.0,0.0,0,...,2017,0,0,1,0,0,0,1,0,0
1,107,3,-6.2,40,0.9,2000,0.0,0.0,0.0,0,...,2017,0,0,1,0,0,0,1,0,0

In [114]:
df2 = pd.read_csv(r"C:\Users\Prajwal\seoulcleandata.csv",header=None,prefix = 'Col')
df2.head(2)

TypeError: read_csv() got an unexpected keyword argument 'prefix'

In [ ]:
df2 = pd.read_csv(r"C:\Users\Prajwal\seoulcleandata.csv",Name=['A','B','C'...])
df2.head(2)
# we can give name to each and every column

In [ ]:
# change the data type of a column
df3 = pd.read_csv(r"C:\Users\Prajwal\seoulcleandata.csv",dtype={'Hour':'float64'})
df3.head(2)

In [ ]:
df3 = pd.read_csv(r"C:\Users\Prajwal\seoulcleandata.csv",true_values=['Yes'],False_values=['No'])
df3.head(2)
# it change the word yess in every rows to True V.V False_values its like name replace into boll

# PART 4

## Handling Missing Values 1

In [ ]:
df = sns.load_dataset("iris")
df.head(2)

In [ ]:
df.isnull().sum()

In [ ]:
# pandas automatically convert blank values to null values
# but in case the values are like 'not available' then use na_values
# it changes those values
df = sns.load_dataset("iris",na_values=['not available']) # for all columns 
df.head(2)
# for specific columns 
df = sns.load_dataset("iris",na_values={'Companies':'no values'}) # we can add more than 1
df.head(2)
# keep as it is those null values from dataset
df = sns.load_dataset("iris",keep_default_na=False) # it already default
df.head(2)

# to boost the performance use na_filter = False not work with null values

# PART 5

## Handling Missing Values 2

In [115]:
df = pd.read_csv('Z:\Fortune_10.csv')
df.head(2)

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018",NaN,5274553,30%
1,2,Stripfind,Financial Services,2010,"$12,329,371","916,455 Dollars",11412916,20%

In [116]:
df.isnull().sum() # it shos category wise

ID           0
Name         0
Industry     0
Inception    0
Revenue      0
Expenses     2
Profit       0
Growth       1
dtype: int64

In [117]:
# total null values
df.isnull().sum().sum()

3

In [121]:
df.notnull().sum()

ID           5
Name         5
Industry     5
Inception    5
Revenue      5
Expenses     3
Profit       5
Growth       4
dtype: int64

In [122]:
df.notnull().sum().sum()

37

In [131]:
sr = pd.Series([1,2,3,np.nan,5,np.NAN])
sr

0    1.0
1    2.0
2    3.0
3    NaN
4    5.0
5    NaN
dtype: float64

# PART 6

## Handling Missing Values 2

In [132]:
df = pd.read_csv('Z:\Fortune_10.csv')
df.head(2)

,ID,Name,Industry,Inception,Revenue,Expenses,Profit,Growth
0,1,Lamtone,IT Services,2009,"$11,757,018",NaN,5274553,30%
1,2,Stripfind,Financial Services,2010,"$12,329,371","916,455 Dollars",11412916,20%

In [139]:
df = df.dropna() # axis=0 it removes rows
# axis = 1 it removes columns
# it drop all row in which null values occur

In [ ]:
df.dropna(how='all')
# if row have all null values it get drop

In [ ]:
df.dropna(thresh=1)
# it removes rows that have null values atleast 1

In [ ]:
df.dropna(subset=['Name'])
# it removes null values from Name columns

In [ ]:
df.dropna(inplace=True)
# it drop nan values and update the dataframe